//=============================================================================
//
// ライフ処理 [lefe.h]
// Author :  有馬　武志
//
//=============================================================================
#ifndef _LIFE_H_
#define _LIFE_H_

#include "main.h"

//*****************************************************************************
// 構造体
//*****************************************************************************
typedef enum
{
	LifeTex_Init = 0,	//テクスチャの初期化
	LifeTex_DAMAGE,		//ダメージを受けたときに減らす
	LifeTex_HIL,
	LifeTex_MAX,		//最大数
}LIFETEX;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitLife(void);
void UninitLife(void);
void UpdateLife(void);
void DrawLife(void);
void DeleteLife(void);																	//
void AddLife(int nLife, LIFETEX Life);
#endif