//=========================================================================================================================
//
// メニューの処理 [manu.h]
// Author :  有馬　武志
//
//=========================================================================================================================
#ifndef _MENU_H_
#define _MENU_H_

#include "main.h"

//*************************************************************************************************************************
// マクロ定義
//*************************************************************************************************************************
#define MAX_MENU	(128)

//*************************************************************************************************************************
// 構造体
//*************************************************************************************************************************
typedef enum
{
	MENU_NORMAL = 0,
	MENU_SELECT,
	MENU_MAX
}MENUSTATE;

typedef enum
{
	ITEM_1 = 0,
	ITEM_2,
	ITEM_3,
	END,
	MAX_MEMU1
}MENUSELECT;

typedef struct
{
	D3DXVECTOR3 pos;
	D3DXCOLOR col;
	float SelectColor;
	int nCntState;
	float MenuHeight;
	float MenuWidtht;
	float PosMenu;
	int nType;
	bool bUse;
	MENUSELECT menu;
	MENUSTATE state;
}MENUIN;

//*************************************************************************************************************************
// プロトタイプ宣言
//*************************************************************************************************************************
void InitMenu(void);						//メニュー初期化処理
void UninitMenu(void);						//メニュー終了処理
void UpdateMenu(void);						//メニュー更新処理
void DrawMenu(void);						//メニュー描画処理
void SetMenu(D3DXVECTOR3 pos, D3DXCOLOR col, float fHeight, float fWidth, int nType);
void DeleteMenu(void);						//
#endif