//=========================================================================================================================
//
// ゲームの処理 [tutorial.h]
// Author :  有馬　武志
//
//=========================================================================================================================
#ifndef _TUTORIAL_H_
#define _TUTORIAL_H_

#include "main.h"
//*************************************************************************************************************************
// 構造体
//*************************************************************************************************************************
typedef enum
{
	TUTORIALSTATE_NONE = 0,		//何もしていない状態
	TUTORIALSTATE_NORMAL,		//通常状態
	TUTORIALSTATE_CLEAR,		//クリア
	TUTORIALSTATE_OVER,			//ゲームオーバー
	TUTORIALSTATE_MAX			//最大数
}TUTORIALSTATE;

//*************************************************************************************************************************
// プロトタイプ宣言
//*************************************************************************************************************************
void InitTutorial(void);							//タイトル初期化処理
void UninitTutorial(void);							//タイトル終了処理
void UpdateTutorial(void);							//タイトル更新処理
void DrawTutorial(void);							//タイトル描画処理
void SetTutorialState(TUTORIALSTATE state);
TUTORIALSTATE GetTutorialState(void);
void SetPauseState(bool bPause);

#endif