//-----------------------------------------------------------------------------
//
//　ポゼッション処理　[possession.h]
//　Author : 有馬　武志
//
//-----------------------------------------------------------------------------
#ifndef _POSSESSION_H_
#define _POSSESSION_H_

//-----------------------------------------------------------------------------
//　インクルードファイル
//-----------------------------------------------------------------------------
#include "main.h"
#include "item.h"
#include "player.h"
#include "input.h"

//-----------------------------------------------------------------------------
// プロトタイプ宣言
//-----------------------------------------------------------------------------
void InitPossession(void);
void UninitPossession(void);
void UpdatePossession(void);
void DrawPossession(void);

#endif