//=============================================================================
//
// タイムの処理 [time.h]
// Author : 有馬　武志
//
//=============================================================================
#ifndef _TIME_H_
#define _TIME_H_

#include "main.h"

//=============================================================================
// フェードの状態
//=============================================================================
typedef struct
{
	int Lenght;					//距離
	int nTime;
}Time;

typedef enum
{
	TIMESTATE_NONE = 0,			//何もしていない状態
	TIMESTATE_NORMAL,			//通常状態
	TIMESTATE_END,				//終了状態
	TIMESTATE_MAX				//最大数
} TIMESTATE;

//=============================================================================
// プロトタイプ宣言
//=============================================================================
void InitTime(void);
void UninitTime(void);
void UpdateTime(void);
void DrawTime(void);
void AddTime(void);

Time *GetTime(void);

#endif
