//=========================================================================================================================
//
// 弾処理 [bullet.h]
// Author :  有馬　武志
//
//=========================================================================================================================
#ifndef _BULLET_H_
#define _BULLET_H_

//*************************************************************************************************************************
// インクルードファイル
//*************************************************************************************************************************
#include "main.h"

#define	MAX_BULLET					(2000)								//弾の最大数
//*************************************************************************************************************************
// 弾の種類の構造体
//*************************************************************************************************************************
typedef enum
{
	BULLETTYPE_PLAYER = 0,
	BULLETTYPE_ENEMY,
	BULLETTYPE_MAX
}BULLETTYPE;

typedef struct
{
	D3DXVECTOR3 pos;		//位置
	D3DXVECTOR3 move;		//
	D3DXCOLOR col;
	BULLETTYPE type;		//種類
	bool bUse;				//使用しているかどうか
	int nDistance;
	int nLife;				//体力
	int nCounterState;		//状態管理のカウンター
}Bullet;


//*************************************************************************************************************************
// プロトタイプ宣言
//*************************************************************************************************************************
void InitBullet(void);									//弾初期化処理
void UninitBullet(void);								//弾終了処理
void UpdateBullet(void);								//弾更新処理
void DrawBullet(void);									//弾描画処理
void SetBullet(D3DXVECTOR3 pos, D3DXVECTOR3 move, D3DXCOLOR col, BULLETTYPE type);		//弾の設定処理
Bullet *GetBullet(void);


#endif