//=========================================================================================================================
//
// 敵処理 [minibossenemy.h]
// Author : 有馬　武志
//
//=========================================================================================================================
#ifndef _MINIBOSSENEMY_H_
#define _MINIBOSSENEMY_H_

//*************************************************************************************************************************
// インクルードファイル
//*************************************************************************************************************************
#include "main.h"

//*************************************************************************************************************************
// マクロ定義
//*************************************************************************************************************************
#define	MAX_ENEMY	(256)	//敵の最大数

//*************************************************************************************************************************
// 構造体定義
//*************************************************************************************************************************
typedef enum
{
	MINIBOSSENEMYSTATE_NORMAL = 0,
	MINIBOSSENEMYSTATE_DAMAGE,
	MINIBOSSENEMYSTATE_MAX
}MINIBOSSENEMYSTATE;

typedef struct
{
	D3DXVECTOR3 pos;		//位置
	D3DXVECTOR3 move;		//移動
	int nType;				//種類
	bool bUse;				//使用しているかどうか
	MINIBOSSENEMYSTATE state;		//敵の状態
	int nLife;				//体力
	int nCounterState;		//状態管理のカウンター
}MiniBossEnemy;

//*************************************************************************************************************************
// プロトタイプ宣言
//*************************************************************************************************************************
void InitMiniBossEnemy(void);										//敵初期化処理
void UninitMiniBossEnemy(void);										//敵終了処理
void UpdateMiniBossEnemy(void);										//敵更新処理
void DrawMiniBossEnemy(void);										//敵描画処理
void SetMiniBossEnemy(D3DXVECTOR3 pos, int nType);					//敵の設定処理
MiniBossEnemy *GetMiniBossEnemy(void);								//敵の取得
void HitMiniBossEnemy(int nCntEnemy, int nDamage);

#endif
