//=========================================================================================================================
//
// プレイヤーの処理 [player.h]
// Author :  有馬　武志
//
//=========================================================================================================================
#ifndef _PLAYER_H_
#define _PLAYER_H_

//*************************************************************************************************************************
//プレイヤー構造体
//*************************************************************************************************************************
typedef enum
{
	PLAYERSTATE_NORMAL = 0,		//通常状態
	PLAYERSTATE_DAMAGE,			//ダメージ状態
	PLAYERSTATE_DEAHT,			//死亡状態	
	PLAYERSTATE_MAX
}PLAYERSTATE;

typedef struct
{
	D3DXVECTOR3 pos;
	D3DXVECTOR3 move;
	D3DXCOLOR col;			//色
	PLAYERSTATE state;		//プレイヤーの状態
	int nLife;				//体力
	int nCounterState;		//状態管理のカウンター
	bool bUse;				//使用しているかどうか
	bool bDisp;				//表示するかしないか
}Player;

//*************************************************************************************************************************
// プロトタイプ宣言
//*************************************************************************************************************************
void InitPlayer(void);				//プレイヤー初期化処理
void UninitPlayer(void);			//プレイヤー終了処理
void UpdatePlayer(void);			//プレイヤー更新処理
void DrawPlayer(void);				//プレイヤー描画処理
void HitPlayer(int nDamage);
Player *GetPlayer(void);

#endif