//=============================================================================
//
// ゲーム処理 [Game.h]
// Author : Ryo Sugimoto
//
//=============================================================================
#ifndef _PRACTICE_H_
#define _PRACTICE_H_

#include "main.h"
#include "Game.h"
#include "scene.h"
#include "scene2D.h"
//*****************************************************************************
// クラスの定義
//*****************************************************************************
class CPractice
{
public:
	CPractice() { };
	~CPractice() {};

	HRESULT Init(void);
	void	Update(void);
	void	Uninit(void);

private://*****************************************************************************
		//変数宣言//*********************************************************************
	int		m_nCntState;	//チュートリアルの進み具合
};

#endif
