//=============================================================================
//
// Select処理 [Select.h]
// Author : Ryo Sugimoto
//
//=============================================================================
#ifndef _SELECT_H_
#define _SELECT_H_

#include "main.h"
#include "scene.h"
#include "scene2D.h"
//*****************************************************************************
// クラスの定義
//*****************************************************************************
#define MAX_SELECT	(4)
#define MAX_LOGO_UV	(6)

//*****************************************************************************
// クラスの定義
//*****************************************************************************
class CSelect
{
public:
	CSelect() {}; ~CSelect() {};

	HRESULT Init(void);
	void	Update(void);
	void	Uninit(void);
private://*****************************************************************************
		//変数宣言//***********************************************************************
	float m_fCntState;				//時間カウント
	int			m_nSelect;			//現在の選択番号
	bool		m_bLabyrinth;		//ラビリンスモードかどうか
	CScene2D	*m_p2DLabyrinth;	//ラビリンス用ポリゴン
	//文字描画用クラス1つ

	CScene2D	*m_p2DSelect[MAX_SELECT];	//選択肢となるポリゴンのアドレス
	CScene2D	*m_p2DEffect[MAX_SELECT];	//選択時出現するポリゴンのアドレス
	CScene2D	*m_p2DMarker;		//選択状態のポリゴンを指すUI

};

#endif
