//=============================================================================
//
// タイトル処理 [Title.h]
// Author : Ryo Sugimoto
//
//=============================================================================
#ifndef _TITLE_H_
#define _TITLE_H_

#include "main.h"
#include "scene.h"
#include "scene2D.h"
//*****************************************************************************
// クラスの定義
//*****************************************************************************
class CTitle
{
public:
	CTitle() { m_p2DTitle = NULL; m_p2DLogo = NULL; }; ~CTitle() {};

	HRESULT Init(void);
	void	Update(void);
	void	Uninit(void);
private://*****************************************************************************
		//変数宣言//***********************************************************************
	float m_fCntState;
	CScene2D	*m_p2DTitle;
	CScene2D	*m_p2DLogo;
};

#endif
