//=========================================================================================================================
//
// 入力処理 [input.h]
// Author : 有馬　武志
//
//=========================================================================================================================
#ifndef _INPUT_H_
#define _INPUT_H_

//*************************************************************************************************************************
// インクルードファイル
//*************************************************************************************************************************
#include "main.h"

//*************************************************************************************************************************
// 構造体
//*************************************************************************************************************************
typedef struct _MSTATE
{
	RECT    moveRect;     // 画面上で動ける範囲
	int     x;            // X座標
	int     y;            // Y座標
	bool    lButton;      // 左ボタン
	bool    rButton;      // 右ボタン
	bool    cButton;      // 真ん中ボタン
	int     moveAdd;      // 移動量
	RECT    imgRect;      // マウス用画像矩形
	int     imgWidth;     // マウス画像幅
	int     imgHeight;    // マウス画像高さ
} MSTATE;

//*************************************************************************************************************************
// プロトタイプ宣言
//*************************************************************************************************************************
HRESULT InitKeyboard(HINSTANCE hInstance, HWND hWnd);			//キーボード初期化処理
void UninitKeyboard(void);										//キーボード終了処理
void UpdateKeyboard(void);										//キーボード更新処理
bool GetKeyboardPress(int Key);									//キーボードプレス
bool GetKeyboardTrigger(int Key);								//キーボードトリガー

HRESULT InitMouse(HINSTANCE hInstance, HWND hWnd);				// マウス初期化処理
void UpdateMouse(void);											// マウス更新処理

bool GetMousePress(int Key);									// マウスプレス
bool GetMouseTrigger(int Key);									// マウストリガー
bool GetMouseRelease(int Key);									// マウスリリース
DIMOUSESTATE2 GetMousePointer(void);

#endif