//=========================================================================================================================
//
// ポーズの処理 [pause.h]
// Author :  有馬　武志
//
//=========================================================================================================================
#ifndef _PAUSE_H_
#define _PAUSE_H_

#include "main.h"

//*************************************************************************************************************************
// マクロ定義
//*************************************************************************************************************************
#define MAX_PAUSE	(128)

//*************************************************************************************************************************
// 構造体
//*************************************************************************************************************************
typedef enum
{
	PAUSE_NORMAL = 0,		//選択していない状態
	PAUSE_SELECT,			//選択した状態
	PAUSE_MAX				//選択時の最大数
}PAUSESTATE;

typedef enum
{
	CONTINU = 0,			//コンテニュー【
	RESULT,					//リザルト【最初からやり直す】
	QUIT,					//クイット【ゲームを終了】
	MAX_MEMU				//選択肢の最大数
}MENU;

typedef struct
{
	D3DXVECTOR3 pos;		//位置
	D3DXCOLOR col;			//色
	float SelectColor;		//選択しているときの色
	int nCntState;			//カウントしている状態
	int	SelectNum;			//セレクトの数
	bool bUse;				//使用しているかどうか
	MENU menu;				//メニューの構造体
	PAUSESTATE state;		//ポーズの状態
}PAUSE;

//*************************************************************************************************************************
// プロトタイプ宣言
//*************************************************************************************************************************
void InitPause(void);		//ポーズ初期化処理
void UninitPause(void);		//ポーズ終了処理
void UpdatePause(void);		//ポーズ更新処理
void DrawPause(void);		//ポーズ描画処理
#endif